fio_test_res/128_64k.txt
test: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=spdk, iodepth=128
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=6559: Thu Aug  7 10:55:01 2025
  read: IOPS=32.9k, BW=2059MiB/s (2159MB/s)(20.1GiB/10011msec)
    slat (nsec): min=296, max=9681, avg=342.31, stdev=79.73
    clat (usec): min=146, max=22689, avg=3883.93, stdev=4781.58
     lat (usec): min=146, max=22689, avg=3884.27, stdev=4781.58
    clat percentiles (usec):
     |  1.00th=[  314],  5.00th=[  449], 10.00th=[  553], 20.00th=[  750],
     | 30.00th=[  947], 40.00th=[ 1188], 50.00th=[ 1500], 60.00th=[ 2008],
     | 70.00th=[ 2966], 80.00th=[ 8094], 90.00th=[13304], 95.00th=[14353],
     | 99.00th=[15664], 99.50th=[16057], 99.90th=[16909], 99.95th=[17171],
     | 99.99th=[18744]
   bw (  MiB/s): min=   15, max= 2071, per=95.34%, avg=1963.03, stdev=446.22, samples=21
   iops        : min=  254, max=33144, avg=31408.38, stdev=7139.43, samples=21
  lat (usec)   : 250=0.23%, 500=7.01%, 750=12.94%, 1000=12.38%
  lat (msec)   : 2=27.37%, 4=15.15%, 10=6.67%, 20=18.24%, 50=0.01%
  cpu          : usr=99.98%, sys=0.01%, ctx=4, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=329789,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=2059MiB/s (2159MB/s), 2059MiB/s-2059MiB/s (2159MB/s-2159MB/s), io=20.1GiB (21.6GB), run=10011-10011msec