fio_test_res/1_512k.txt
test: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=spdk, iodepth=1
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=117967: Thu Aug  7 10:50:37 2025
  read: IOPS=1698, BW=849MiB/s (890MB/s)(8492MiB/10001msec)
    slat (nsec): min=1532, max=7112, avg=1657.51, stdev=203.91
    clat (usec): min=368, max=3497, avg=586.58, stdev=154.51
     lat (usec): min=370, max=3499, avg=588.24, stdev=154.51
    clat percentiles (usec):
     |  1.00th=[  416],  5.00th=[  453], 10.00th=[  474], 20.00th=[  506],
     | 30.00th=[  529], 40.00th=[  545], 50.00th=[  570], 60.00th=[  594],
     | 70.00th=[  619], 80.00th=[  652], 90.00th=[  709], 95.00th=[  758],
     | 99.00th=[  857], 99.50th=[  906], 99.90th=[ 3163], 99.95th=[ 3195],
     | 99.99th=[ 3458]
   bw (  KiB/s): min=846848, max=883712, per=100.00%, avg=869580.80, stdev=10655.20, samples=20
   iops        : min= 1654, max= 1726, avg=1698.40, stdev=20.81, samples=20
  lat (usec)   : 500=18.31%, 750=76.38%, 1000=4.99%
  lat (msec)   : 2=0.08%, 4=0.24%
  cpu          : usr=99.97%, sys=0.00%, ctx=4, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16984,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=849MiB/s (890MB/s), 849MiB/s-849MiB/s (890MB/s-890MB/s), io=8492MiB (8905MB), run=10001-10001msec