fio_test_res/1_64k.txt
test: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=spdk, iodepth=1
fio-3.40-34-g306d8
Starting 1 thread
EAL: No legacy callbacks, legacy socket not created

test: (groupid=0, jobs=1): err= 0: pid=116053: Thu Aug  7 10:50:09 2025
  read: IOPS=4116, BW=257MiB/s (270MB/s)(2573MiB/10001msec)
    slat (nsec): min=307, max=5350, avg=344.12, stdev=73.65
    clat (usec): min=112, max=3147, avg=242.03, stdev=67.02
     lat (usec): min=112, max=3148, avg=242.37, stdev=67.02
    clat percentiles (usec):
     |  1.00th=[  149],  5.00th=[  169], 10.00th=[  176], 20.00th=[  190],
     | 30.00th=[  204], 40.00th=[  221], 50.00th=[  235], 60.00th=[  251],
     | 70.00th=[  265], 80.00th=[  285], 90.00th=[  318], 95.00th=[  347],
     | 99.00th=[  412], 99.50th=[  441], 99.90th=[  545], 99.95th=[  652],
     | 99.99th=[ 2966]
   bw (  KiB/s): min=257792, max=266496, per=100.00%, avg=263513.60, stdev=1992.12, samples=20
   iops        : min= 4028, max= 4164, avg=4117.40, stdev=31.13, samples=20
  lat (usec)   : 250=60.01%, 500=39.81%, 750=0.15%, 1000=0.01%
  lat (msec)   : 4=0.01%
  cpu          : usr=99.93%, sys=0.03%, ctx=7, majf=0, minf=2
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=41174,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=257MiB/s (270MB/s), 257MiB/s-257MiB/s (270MB/s-270MB/s), io=2573MiB (2698MB), run=10001-10001msec